# Analytics Tools
brew 'python'
cask 'anaconda'
brew 'conda-zsh-completion'

# System tools
brew 'romkatv/powerlevel10k/powerlevel10k'
cask 'font-meslo-lg-nerd-font'
brew 'gnupg'
brew 'watch'
brew 'zsh'
brew 'htop'
brew 'zsh-completions'

#Dev Tools
brew 'git-credential-manager'
brew 'gh'
brew 'kubectl'
brew 'terraform'
brew 'azure-cli'
brew 'awscli'
brew 'helm'

# Applications
cask 'visual-studio-code'
cask 'aerial'
cask 'lastpass'

# Mac App Store Apps
#mas '1Blocker', id: 1365531024
#mas 'Microsoft To Do', id: 1274495053
#mas 'Microsoft Remote Desktop', id: 1295203466
#mas 'Twitter', id: 1482454543
