# Azure tooling

brew 'azure-cli'
brew 'azure-functions-core-tools@3'
cask 'microsoft-azure-storage-explorer'

# Utilities
brew 'youtube-dl'


# System tools
brew 'powerlevel10k'
brew 'gnupg'
brew 'neofetch'
brew 'watch'
brew 'zsh'

#Dev Tools
cask 'git-credential-manager-core'

# Applications
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'powershell'
cask 'visual-studio-code'

# Mac App Store Apps
mas '1Blocker', id: 1107421413
mas 'Microsoft To Do', id: 1274495053
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Twitter', id: 1482454543