# Azure tooling

brew 'azure-cli'
brew 'azure-functions-core-tools'
cask 'microsoft-azure-storage-explorer'

# Utilities
brew 'youtube-dl'
brew 'zsh-completions'

# Analytics Tools
brew python
brew anaconda

# System tools
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'gnupg'
brew 'neofetch'
brew 'watch'
brew 'zsh'

#Dev Tools
brew 'git-credential-manager'

# Applications
cask 'microsoft-edge'
cask 'microsoft-teams'
cask 'powershell'
cask 'visual-studio-code'
cask 'aerial'
cask 'lastpass'

# Mac App Store Apps
mas '1Blocker', id: 1365531024
mas 'Microsoft To Do', id: 1274495053
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Twitter', id: 1482454543